//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#ifndef APP_PROTOCOL_EASYINK_H
#define APP_PROTOCOL_EASYINK_H
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#ifndef snail_data_types
    #include ".\depend\snail_data_types.h"
#endif
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//简易版固件升级协议easy ink
//负责协议的解释
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
typedef struct
{
    sdt_int8u eik_apt_length;  //接收信息的数据长度
    sdt_int8u *pEik_apt_buff;  //接收信息的数据指针
    sdt_int8u eik_ans_lenght;  //应答信息的数据长度
    sdt_int8u *pEik_ans_buff;  //应答信息的数据指针,本函数修改这个指针值,传入的指针可以是NONE
}EZINK_MSG_DEF;
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//task++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
void app_easyink_reboot_task(void);
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//interface+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//功能:固件升级数据交换模块
//入口:接收的数据长度和指针,应答的数据长度和指针
//出口:sdt_true 文件传输完成
//------------------------------------------------------------------------------
sdt_bool app_easyink_message_exchange(EZINK_MSG_DEF *mix_ezink_msg);
//end+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#endif
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++