#ifndef MDE_UPDATE_FILES_H
#define MDE_UPDATE_FILES_H
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#ifndef snail_data_types
    #include ".\depend\snail_data_types.h"
#endif
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//固件升级文件处理模块。
//升级数据以文件流的方式进入此模块，存入应用区。
//数据以块的方式压入，128bytes为一个数据块。
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#define ERRUF_NONE               0x00
#define ERRUF_LENGTH             0x01
#define ERRUF_VERSION            0x02
#define ERRUF_CMD                0x03
#define ERRUF_MAP_CS             0x04
#define ERRUF_FILE_CS            0x05
#define ERRUF_BLOCK_NUM          0x06
#define ERRUF_FIREWARE           0x07
#define ERRUF_MAP_VER            0x08
#define ERRUF_OTHER              0xFE
//task++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//none
//interface+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//名称:推入文件分布map数据到文件模块
//入口:map数据指针(128bytes)，是否续传 sdt_true 续传
//出口:错误指示
//------------------------------------------------------------------------------
sdt_int8u mde_push_updateFile_map(sdt_int8u *pIn_buff,sdt_bool in_resume);
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//名称:推入一个块的数据到文件模块
//入口:块序号、块数据指针，块大小默认为128bytes
//出口:错误指示
//------------------------------------------------------------------------------
sdt_int8u mde_push_updateFiles_oneBlock(sdt_int8u *pIn_buff,sdt_int16u in_block);
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//------------------------------------------------------------------------------
//名称:获取下一个数据块的序号值
//入口:序号块指针
//出口:是否传输完毕，sdt_true -- 传输完毕
//------------------------------------------------------------------------------
sdt_bool mde_pull_updateFiles_nextBlock(sdt_int16u *pOut_block);
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//------------------------------------------------------------------------------
//名称:APP运行区的数据合法判断
//入口:硬件标识
//出口:sdt_true -- 数据合法
//------------------------------------------------------------------------------
sdt_bool mde_pull_appSectionFiles_iegal(sdt_int32u in_hardware_flag);
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//名称:PC指针跳转到APP区运行代码
//入口:
//出口:
//------------------------------------------------------------------------------
void jumpToApplication(void);
//end+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#endif
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++